{
	"_class_name": "CondUNet2DModel",
	"_diffusers_version": "0.18.2",
	"act_fn": "silu",
	"attention_head_dim": 8,
	"block_out_channels": [
		128,
		256,
		512
	],
	"center_input_sample": false,
	"class_embed_type": null,
	"down_block_types": [
		"DownBlock2D",
		"DownBlock2D",
		"AttnDownBlock2D"
	],
	"downsample_padding": 1,
	"flip_sin_to_cos": true,
	"freq_shift": 0,
	"in_channels": 3,
	"layers_per_block": 2,
	"mid_block_scale_factor": 1,
	"norm_eps": 1e-05,
	"norm_num_groups": 32,
	"num_class_embeds": 2,
	"out_channels": 3,
	"resnet_time_scale_shift": "default",
	"sample_size": 128,
	"time_embedding_type": "positional",
	"up_block_types": [
		"AttnUpBlock2D",
		"UpBlock2D",
		"UpBlock2D"
	]
}